<template>
  <svg
    width="100%"
    height="100%"
    viewBox="0 0 512 512"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      id="textPath"
      d="M244 84L255.1 96L267.1 84.02C300.6 51.37 347 36.51 392.6 44.1C461.5 55.58 512 115.2 512 185.1V190.9C512 232.4 494.8 272.1 464.4 300.4L283.7 469.1C276.2 476.1 266.3 480 256 480C245.7 480 235.8 476.1 228.3 469.1L47.59 300.4C17.23 272.1 0 232.4 0 190.9V185.1C0 115.2 50.52 55.58 119.4 44.1C164.1 36.51 211.4 51.37 244 84C243.1 84 244 84.01 244 84L244 84zM255.1 163.9L210.1 117.1C188.4 96.28 157.6 86.4 127.3 91.44C81.55 99.07 48 138.7 48 185.1V190.9C48 219.1 59.71 246.1 80.34 265.3L256 429.3L431.7 265.3C452.3 246.1 464 219.1 464 190.9V185.1C464 138.7 430.4 99.07 384.7 91.44C354.4 86.4 323.6 96.28 301.9 117.1L255.1 163.9z"
      stroke="transparent"
    />
    <text class="text">
      <textPath href="#textPath" startOffset="30">
        Спасити помогити мне как я устал эти svg делать. Красиво конечно
        получается, но зачем оно вообще надо. Я делаю делаю, а всё для чего.
        Просто хочу кушоть.Просто хочу кушоть.Просто хочу кушоть.Просто хочу
        кушоть.Просто хочу кушоть.Просто хочу кушоть.Просто хочу кушоть.Просто
        хочу кушоть.
      </textPath>
    </text>
  </svg>
</template>

<style lang="scss" scoped>
svg {
  overflow: visible;
}
.text {
  fill: black;
  font-size: 1.2em;
  letter-spacing: 3px;
}
</style>

M1.13828 11.5128C-0.63204 25.6592 13.8846 48.8344 86.1135 28.3637C176.4 2.77524 248.042 -6.46508 255.968 16.2198C263.565 37.9602 317.14 58.9449 396.804 38.9735C476.468 19.0021 432.993 -11.3965 540 6.3569